Advent of Code 2020
-------------------
https://adventofcode.com/2020/

## Day 1

--- Day 1: Report Repair ---

After saving Christmas five years in a row, you've decided to take a vacation at a nice resort on a tropical island. Surely, Christmas will go on without you.

The tropical island has its own currency and is entirely cash-only. The gold coins used there have a little picture of a starfish; the locals just call them stars. None of the currency exchanges seem to have heard of them, but somehow, you'll need to find fifty of these coins by the time you arrive so you can pay the deposit on your room.

To save your vacation, you need to get all fifty stars by December 25th.

Collect stars by solving puzzles. Two puzzles will be made available on each day in the Advent calendar; the second puzzle is unlocked when you complete the first. Each puzzle grants one star. Good luck!

Before you leave, the Elves in accounting just need you to fix your expense report (your puzzle input); apparently, something isn't quite adding up.

Specifically, they need you to find the two entries that sum to 2020 and then multiply those two numbers together.

For example, suppose your expense report contained the following:

1721
979
366
299
675
1456
In this list, the two entries that sum to 2020 are 1721 and 299. Multiplying them together produces 1721 * 299 = 514579, so the correct answer is 514579.

Of course, your expense report is much larger. Find the two entries that sum to 2020; what do you get if you multiply them together?

In [2]:
import pandas as pd

In [76]:
data = pd.read_csv('input.txt', header=None)
print('Preview of the data')
print(data)

Preview of the data
        0
0    1645
1    1995
2    1658
3    1062
4    1472
..    ...
195  1423
196  1718
197  1714
198  1923
199  1503

[200 rows x 1 columns]

In [77]:
#storing the data in a dataframe and creating a second column with exactly
#the same values, to facilitate the calculation

data[1] = data[0]
data.columns=['ori','copy']
data

      ori  copy
0    1645  1645
1    1995  1995
2    1658  1658
3    1062  1062
4    1472  1472
..    ...   ...
195  1423  1423
196  1718  1718
197  1714  1714
198  1923  1923
199  1503  1503

[200 rows x 2 columns]

In [78]:
nb_poss = (len(data)**2)-len(data)
print('Number of possibilities (with doublons) : {}'.format(nb_poss))

Number of possibilities (with doublons) : 39800

In [41]:
result = []
for i,j,k in data.itertuples():
    for l,m,n in data.itertuples():
        if j == m:
            continue
        result.append([j, m, j + m])
result = pd.DataFrame(result, columns=['chiffre1', 'chiffre2', 'resultat'])
result

       chiffre1  chiffre2  resultat
0          1645      1995      3640
1          1645      1658      3303
2          1645      1062      2707
3          1645      1472      3117
4          1645      1710      3355
...         ...       ...       ...
39795      1503      1844      3347
39796      1503      1423      2926
39797      1503      1718      3221
39798      1503      1714      3217
39799      1503      1923      3426

[39800 rows x 3 columns]

In [48]:
print("Displaying the results : two lines should appear as both ways were calculated")
result['resultat'][result['resultat'] == 2020]

Displaying the results : two lines should appear as both ways were calculated

28423    2020
33176    2020
Name: resultat, dtype: int64

In [75]:
res_summary = result['resultat'][result['resultat'] == 2020]

#Checking that there are only two results
if res_summary.count() == 2:
    print("The result has two elements which is ok")
else:
    print("The result has MORE than two elements which is NOT normal")

#finding the first 
res_line = res_summary.index[0]

#display the figues used to find the answer
print('Displaying the figures used to find the answer')
result.iloc[res_line]

The result has two elements which is ok
Displaying the figures used to find the answer

chiffre1      28
chiffre2    1992
resultat    2020
Name: 28423, dtype: int64

In [83]:
#multiplying the figures to find the answer

final_res = result.iloc[res_line][0] * result.iloc[res_line][1]
print('Final result : {}'.format(final_res))

Final result : 55776